src/test/resources/xml/soap-forward-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:com.prokarma.app.middleware:enterprise-event-bus:1.0">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:forward>
         <!--Optional:-->
         <query>
            <topic>xyz</topic>
            <publisher>nadeem</publisher>
            <from>2015-03-05T19:25:47.260+05:30</from>
            <to>2015-03-06T19:25:47.306+05:30</to>
         </query>
      </urn:forward>
   </soapenv:Body>
</soapenv:Envelope>